Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: RedHat maintains slightly outdated but still useful documentation at http: / /www.redhat.com / products / ccvs / support / CCVS3.3docs / ProgPHP.html.
es: Red Hat casi no mantiene la documentación de CCVS, pero todavia es de gran ayuda, se puede encontrar en http: / /www.redhat.com / products / ccvs / support / CCVS3.3docs / ProgPHP.html.

source: These functions allow you to obtain information about classes and instance objects.
es: Estas funciones permiten obtener informacion sobre clases y objetos.

source: You can obtain the name of the class to which a object belongs, as well as its member properties and methods.
es: Se puede obtener el nombre de la clase a la que pertenece un objeto, asi como las propiedades de sus miembros y métodos.

source: The base class describes a general vegetable, whether it is edible or not and what is its color.
es: La subclase Spinach añade un metodo para cocinarlo y otro para saber si esta cocinado.

source: The subclass Spinach adds a method to cook it and another to find out if it is cooked.
es: Ejemplo 1. classes.inc

source: We then instantiate 2 objects from these classes and print out information about them, including their class parentage.
es: Creamos 2 objetos de estas clases e imprimimos información sobre ellos, incluyendo la jerarquia de clases a la que pertenecen.

source: We also define some utility functions, mainly to have a nice printout of the variables.
es: También definimos algunas funciones, especialmente para imprimir las variables de una manera ordenada.

source: Example 2. test_script.php
es: Ejemplo 2. test_script.php

source: COM functions are only available on the Windows version of PHP.
es: Estas funciones solo están disponibles en la versión para Windows de PHP.

source: For further information on COM read the COM specification or perhaps take a look at Don Box' s Yet Another COM Library (YACL)
es: Estas funciones han sido añadidas en PHP4.

source: ClibPDF lets you create PDF documents with PHP.
es: ClibPDF Le permite crear documentos PDF con PHP.

source: ClibPDF functionality and API are similar to PDFlib.
es: Está disponible en FastIO pero no es software libre.

source: This documentation should be read alongside the ClibPDF manual since it explains the library in much greater detail.
es: Debería leer la licencia antes de comenzar a utilizar ClibPDF.

source: Many functions in the native ClibPDF and the PHP module, as well as in PDFlib, have the same name.
es: Si usted no puede cumplir el acuerdo de la licencia considere el utilizar la pdflib de Thomas Merz, que tambien es muy potente.

source: Currently this handle is not used internally since ClibPDF does not support the creation of several PDF documents at the same time.
es: La funcionalidad y la API de ClibPDF son similares a la pdflib de Thomas Merz pero, de acuerdo con FastIO, ClibPDF es mas rápida y crea documentos mas pequeños.

source: Actually, you should not even try it, the results are unpredictable.
es: Esto puede haber cambiado con la nueva versión 2.0 de pdflib.

source: According to the author of ClibPDF this will change in one of the next releases (current version when this was written is 1.10).
es: Un simple banco de pruebas (el ejemplo pdfclock.c de pdflib 2.0 trasformado en un script php) en realidad no muestra ninguna diferencia en velocidad.

source: If you need this functionality use the pdflib module.
es: Por tanto, pruebe las dos y vea cual hace el mejor trabajo para usted.

source: A nice feature of ClibPDF (and PDFlib) is the ability to create the pdf document completely in memory without using temporary files.
es: Esta documentación debería ser leída junto con el manual de ClibPDF ya que este explica la librería con mucho mas detalle.

source: It also provides the ability to pass coordinates in a predefined unit length. (This feature can also be simulated by pdf_translate() when using the PDFlib functions.)
es: Muchas funciones en le ClibPDF nativa y el módulo PHP, así como en pdflib, tienen el mismo nombre.

source: Another nice feature of ClibPDF is the fact that any page can be modified at any time even if a new page has been already opened.
es: Todas las funciones excepto cpdf_open() toman el manejador del documento com el primer parámetro.

source: The function cpdf_set_current_page() allows to leave the current page and presume modifying an other page.
es: Actualmente este manejador no se usa internamente desde que ClibPDF no soporta la creación de varios documentos PDF al mismo tiempo.

source: Most of the functions are fairly easy to use.
es: Realmente, ni debería intentarlo, los resultados son impredecibles.

source: The most difficult part is probably creating a very simple PDF document at all.
es: No puedo supervisar cuales son las consecuencias en un sistema multihilo.

source: It creates a document with one page.
es: De acuerdo con el autor de ClibPDF, esto cambiará en alguno de las próximas veriones (la versión actual, cuando eto fue escrito es 1.10).

source: The page contains the text "Times-Roman" in an outlined 30pt font.
es: Si usted necesita esta capacidad, use el módulo pdflib.

source: The text is underlined.
es: Nota:

source: In order to use the ClibPDF functions you need to install the ClibPDF package.
es: La función cpdf_set_font() ha cambiado desde que PHP3 soporta fuentes asiáticas.

source: PHP requires that you use cpdflib = 2.
es: Una gran ventaja de ClibPDF sobre pdflib es la posibilidad de crear el documento PDF completamente en memoria sin usar ficheros temporales.

source: To get these functions to work, you have to compile PHP with --with-cpdflib[ =DIR].
es: Esto también proporciona la capaciad de pasar coordenadas en una unidad de longitud predefinida.

source: DIR is the cpdflib install directory, defaults to / usr.
es: Esta es una cualidad útil pero puede ser simulada con pdf_translate().

source: In addition you can specify the jpeg library and the tiff library for ClibPDF to use.
es: La mayoría de las funciones son fáciles de usar.

source: To do so add to your configure line the options --with-jpeg-dir[ =DIR] --with-tiff-dir[=DIR].
es: La parte mas difícil es, probablemente, crear un documento PDF muy simple.

source: Simple ClibPDF Example
es: Ejemplo 1.

source: ?php $cpdf = cpdf_open( 0); cpdf_page_init($cpdf, 1, 0, 595, 842, 1.0); cpdf_add_outline($cpdf, 0, 0, 0, 1, "Page 1"); cpdf_begin_text($cpdf); cpdf_set_font($cpdf, "Times-Roman", 30, "WinAnsiEncoding"); cpdf_set_text_rendering($cpdf, 1); cpdf_text($cpdf, "Times Roman outlined", 50, 750); cpdf_end_text($cpdf); cpdf_moveto($cpdf, 50, 740); cpdf_lineto($cpdf, 330, 740); cpdf_stroke($cpdf); cpdf_finalize($cpdf); Header("Content-type: application / pdf"); cpdf_output_buffer($cpdf); cpdf_close($cpdf);?
es: ?php $cpdf = cpdf_open( 0); cpdf_page_init($cpdf, 1, 0, 595, 842); cpdf_add_outline($cpdf, 0, 0, 0, 1, "Page 1"); cpdf_set_font($cpdf, "Times-Roman", 30, "WinAnsiEncoding"); cpdf_set_text_rendering($cpdf, 1); cpdf_text($cpdf, "Times Roman outlined", 50, 750); cpdf_moveto($cpdf, 50, 740); cpdf_lineto($cpdf, 330, 740); cpdf_stroke($cpdf); cpdf_finalize($cpdf); Header("Content-type: application / pdf"); cpdf_output_buffer($cpdf); cpdf_close($cpdf);?

source: The pdflib distribution contains a more complex example which creates a series of pages with an analog clock.
es: La distribución de pdflib contiene un ejemplo mas comlejo que crea una serie de páginas con un reloj analógico.

source: Here is that example converted into PHP using the ClibPDF extension:
es: Aquí está ese ejemplo convertido en PHP usando la extensión ClibPDF:

source: Example 2. pdfclock example from pdflib 2.0 distribution
es: Ejemplo con pdfclock de la distribución pdflib 2.0

source: See also the PDFlib extension documentation.
es: ?php $radius = 200; $margin = 20; $pagecount = 40; $pdf = cpdf_open(0); cpdf_set_creator($pdf, "pdf_clock.php3"); cpdf_set_title($pdf, "Reloj Analógico"); while($pagecount- - 0) {cpdf_page_init($pdf, $pagecount+1, 0, 2 * ($radius + $margin), 2 * ($radius + $margin), 1.0); cpdf_set_page_animation($pdf, 4, 0.5, 0, 0, 0); / * limpiar * / cpdf_translate($pdf, $radius + $margin, $radius + $margin); cpdf_save($pdf); cpdf_setrgbcolor($pdf, 0.0, 0.0, 1.0); / * cambio de minuto * / cpdf_setlinewidth($pdf, 2.0); for ($alpha = 0; $alpha 360; $alpha += 6) {cpdf_rotate($pdf, 6.0); cpdf_moveto($pdf, $radius, 0.0); cpdf_lineto($pdf, $radius-$margin / 3, 0.0); cpdf_stroke($pdf);} cpdf_restore($pdf); cpdf_save($pdf); / * cambios de 5 minutos * / cpdf_setlinewidth($pdf, 3.0); for ($alpha = 0; $alpha 360; $alpha += 30) {cpdf_rotate($pdf, 30.0); cpdf_moveto($pdf, $radius, 0.0); cpdf_lineto($pdf, $radius-$margin, 0.0); cpdf_stroke($pdf);} $ltime = getdate(); / * dibujar la aguja de las horas * / cpdf_save($pdf); cpdf_rotate($pdf, -(($ltime['minutos'] / 60.0) + $ltime['horas'] - 3.0) * 30.0); cpdf_moveto($pdf, -$radius / 10, -$radius / 20); cpdf_lineto($pdf, $radius / 2, 0.0); cpdf_lineto($pdf, -$radius / 10, $radius / 20); cpdf_closepath($pdf); cpdf_fill($pdf); cpdf_restore($pdf); / * dibujar el minutero * / cpdf_save($pdf); cpdf_rotate($pdf, -(($ltime['segundos'] / 60.0) + $ltime['minutos'] - 15.0) * 6.0); cpdf_moveto($pdf, -$radius / 10, -$radius / 20); cpdf_lineto($pdf, $radius * 0.8, 0.0); cpdf_lineto($pdf, -$radius / 10, $radius / 20); cpdf_closepath($pdf); cpdf_fill($pdf); cpdf_restore($pdf); / * dibujar la seguna mano * / cpdf_setrgbcolor($pdf, 1.0, 0.0, 0.0); cpdf_setlinewidth($pdf, 2); cpdf_save($pdf); cpdf_rotate($pdf, -(($ltime['segundos'] - 15.0) * 6.0)); cpdf_moveto($pdf, -$radius / 5, 0.0); cpdf_lineto($pdf, $radius, 0.0); cpdf_stroke($pdf); cpdf_restore($pdf); / * dibujar un pequeño círculo en el centro * / cpdf_circle($pdf, 0, 0, $radius / 30); cpdf_fill($pdf); cpdf_restore($pdf); cpdf_finalize_page($pdf, $pagecount+1);} cpdf_finalize($pdf); Header("Content-type: application / pdf"); cpdf_output_buffer($pdf); cpdf_close($pdf);?

source: This extension has no resource types defined.
es: Esta extensión no define ningún tipo de recurso.

source: These functions have been added in PHP 4.0.2.
es: PHP supports libcurl, a library, created by Daniel Stenberg, that allows you to connect and communicate to many different types of servers with many different types of protocols. libcurl currently supports the http, https, ftp, gopher, telnet, dict, file, and ldap protocols. libcurl also supports HTTPS certificates, HTTP POST, HTTP PUT, FTP uploading (this can also be done with PHP's ftp extension), HTTP form based upload, proxies, cookies and user+password authentication.

source: In order to enable this module on a Windows environment, you must copy libeay32.dll and ssleay32.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:
es: There should be a file named "libcurl.a" located in the "lib "directory.

source: The basic idea behind the CURL functions is that you initialize a CURL session using the curl_init(), then you can set all your options for the transfer via the curl_setopt(), then you can execute the session with the curl_exec() and then you finish off your session using the curl_close().
es: The basic idea behind the CURL functions is that you initialize a CURL session using the curl_init(), then you can set all your options for the transfer via the curl_exec() and then you finish off your session using the curl_close().

source: Here is an example that uses the CURL functions to fetch the example.com homepage into a file:
es: Here is an example that uses the CURL functions to fetch the PHP homepage into a file:

source: Using PHP 's CURL module to fetch the example.com homepage
es: Using PHP 's CURL module to fetch the PHP homepage

source: ?php $ch = curl_init ("http: / /www.example.com / "); $fp = fopen ("example_homepage.txt", "w"); curl_setopt ($ch, CURLOPT_FILE, $fp); curl_setopt ($ch, CURLOPT_HEADER, 0); curl_exec ($ch); curl_close ($ch); fclose ($fp);?
es: ?php $ch = curl_init ("http: / /www.php.net / "); $fp = fopen ("php_homepage.txt", "w"); curl_setopt ($ch, CURLOPT_INFILE, $fp); curl_setopt ($ch, CURLOPT_HEADER, 0); curl_exec ($ch); curl_close ($ch); fclose ($fp);?

source: This extension has been removed from PHP as of PHP 4.3.0, if you have questions as to why then you will find the following CyberCash Faq helpful.
es: Estas funciones solo están disponibles si el intérprete ha sido compilado con --with-cybercash=[ DIR].

source: See the above faq for details.
es: Estas funciones han sido añadidas en PHP4.

source: These functions allow you to get the date and time from the server where your PHP scripts are running.
es: Anterior

source: Make sure to take daylight saving time and leap years into consideration when working with these functions.
es: Anterior

source: There is no installation needed to use these functions; they are part of the PHP core.
es: Inicio

source: dba_sync
es: Subir

source: This is a general abstraction layer for several file-based databases.
es: Estas funciones son la base para el acceso a bases de datos del estilo Berkeley DB.

source: The behaviour of various aspects depends on the implementation of the underlying database.
es: Este es un nivel de abstraccion general para varias bases de datos.

source: You have to download and install supported dba-Handlers.
es: Como tal su funcionalidad esta limitada a un grupo de modernas bases de datos como Sleepycat Software' s DB2. (Esta no debe confundirse con IBM DB2 software, la cual es soportada mediante las funciones ODBC.)

source: You should avoid it, if possible.
es: El comportamiento de varios aspectos depende de la implementacion de la base de datos.

source: ndbm
es: Funciones como dba_optimize() y dba_sync() cumpliran su funcionalidad con unas bases de datos pero no con otras.

source: It still has most of the arbitrary limits of dbm (therefore it is deprecated).
es: Los siguientes manejadores (handlers) estan soportados:

source: It is described as "a programmatic toolkit that provides high-performance built-in database support for both standalone and client / server applications.
es: dbm es el mas antiguo (original) tipo de base de datos de la familia de Berkeley DB.

source: This is available since PHP 5.0.0.
es: Se debe evitar su uso, si es posible.

source: Since it is constant, we support only reading operations.
es: Nosotros no soportamos las funciones de compatibilidad de DB2 y gdbm, porque ellas solo son compatibles a nivel de codigo fuente, pero no pueden manejar el formato original dbm.

source: cdb_make
es: ndbm es un tipo mas nuevo y mas flexible que dbm.

source: flatfile
es: Todavia tiene la mayoria de las limitaciones de dbm (Por lo tanto es descartado).

source: However you may use this where files were created in this format.
es: gdbm es el gestor de bases de datos de GNU (database manager).

source: That happens when configure could not find any external library.
es: db2 es Sleepycat Software 's DB2.

source: The actually available list of handlers is displayed by invoking phpinfo() or dba_handlers().
es: Es descrito como "un conjunto de herramientas de programacion que proveen acceso de alto nivel a bases de datos en aplicaciones standalone o en el modelo cliente / servidor."

source: You also have to add support for at least one of the following handlers by specifying the --with-XXXX configure switch to your PHP configure line.
es: cdb es "una rapida, de confianza, sencilla herramienta para la creacion y lectura de bases de datos constantes." Fue creada por el autor de qmail y puede encontrarse en here.

source: It is not possible to use db versions starting from 4.1 with PHP prior to version 4.3.0.
es: Como la base es constante solo se soportan las operaciones de lectura.

source: Since PHP 4.3.0 you can omit DIR to use the bundeled cdb library that adds the cdb_make handler which allows creation of cdb files and allows to access cdb files on the network using php 's streams.
es: Ejemplo 1.

source: Uee this handler only when you cannot install one of the libraries required by the other handlers and when you cannot use bundeled cdb handler.
es: ?php $id = dba_open( "/ tmp / test.db", "n", "db2"); if(!$id) {echo "dba_open failed\n"; exit;} dba_replace("key", "This is an example !", $id); if(dba_exists("key", $id)) {echo dba_fetch("key", $id); dba_delete("key", $id);} dba_close($id);?

source: Up to PHP 4.3.0 you are able to add both db2 and db3 handler but only one of them can be used internally.
es: DBA es "binary safe" y no tiene ningun limite arbitrario.

source: Starting with PHP 5.0.0 there is a configuration check avoid such missconfigurations.
es: Hereda todas sus limitaciones de la implementacion de base de datos que tenga.

source: The functions dba_open() and dba_popen() return a handle to the specified database file to access which is used by all other dba-function calls.
es: Todos las bases de datos basadas en ficheros deben proveer un mecanismo para establecer el modo a la hora de crear nuevas bases de datos, si ello es posible.

source: DBA is binary safe and does not have any arbitrary limits.
es: Se puede acceder a todas las entradas de una base de datos de modo secuencial (lineal) usando las funciones dba_firstkey() y dba_nextkey().

source: All file-based databases must provide a way of setting the file mode of a new created database, if that is possible at all.
es: No se puede cambiar la base de datos mientras se recorre (traversing) por ella.

source: You can access all entries of a database in a linear way by using the dba_firstkey() and dba_nextkey() functions.
es: Ejemplo 2.

source: These functions allow you to access records stored in dBase-format (dbf) databases.
es: Estas funciones permiten el acceso a datos almacenados en formato dBase (dbf).

source: There is no support for indexes or memo fields.
es: No hay soporte para índices o campos Memo.

source: Two concurrent webserver processes modifying the same dBase file will very likely ruin your database.
es: Tampoco hay soporte para bloqueo: si dos procesos concurrentes en el servidor modifican el mismo fichero dBase, probablemente se destruirán los datos.

source: dBase files are simple sequential files of fixed length records.
es: A diferencia de las bases de datos SQL, las "bases de datos" dBase no pueden cambiar su definición.

source: Records are appended to the end of the file and delete records are kept until you call dbase_pack().
es: Una vez creado el fichero, la definición de la base de datos es fija.

source: We recommend that you do not use dBase files as your production database.
es: No hay índices que aceleren la búsqueda u organicen los datos de distinto modo.

source: Choose any real SQL server instead; MySQL or Postgres are common choices with PHP. dBase support is here to allow you to import and export data to and from your web database, because the file format is commonly understood by Windows spreadsheets and organizers.
es: Los nuevos registros se añaden al final del fichero y los registros borrados se conservan hasta que se llama a la función dbase_pack( )().

source: In order to enable the bundled dbase library and to use these functions, you must compile PHP with the --enable-dbase option.
es: Se recomienda no utilizar ficheros dBase como bases de datos, sino elegir cualquier servidor SQL; MySQL o Postgres son opciones habituales con PHP.

source: To use this functions you have to compile PHP with support for an underlying database.
es: Estas funcione le permiten almacenar registros en una base de datos estilo dbm.

source: In addition you must ensure support for an underlying database or you can use some sytem libraries.
es: Este tipo de base de datos (soportadas por las librerías db y gdbm de Berkeley, así como por algunas librerías del sistema y por una librería incluída para acceso a archivos de texto) guarda pares clave / valor (en oposición a los registros completos soportados por las bases de datos relacionales).

source: The function dbmopen() returns an database identifier which is used by the other dbm-functions.
es: Ejemplo 1. ejemplo de dbm

source: $dbm = dbmopen ("lastseen", "w"); if (dbmexists ($dbm, $userid)) {$last_seen = dbmfetch ($dbm, $userid);} else {dbminsert ($dbm, $userid, time());} do_stuff(); dbmreplace ($dbm, $userid, time()); dbmclose ($dbm);
es: $dbm = dbmopen( "vistoya", "w"); if (dbmexists($dbm, $idusuario)) {$visto_ya = dbmfetch($dbm, $idusuario);} else {dbminsert($dbm, $idusuario, time());} do_stuff(); dbmreplace($dbm, $idusuario, time()); dbmclose($dbm);

source: This extension is EXPERIMENTAL.
es: Este módulo es EXPERIMENTAL.

source: The behaviour of this extension - - including the names of its functions and anything else documented about this extension - - may change without notice in a future release of PHP.
es: Esto significa que el comportamineto de estas funciones, nombre de funciones y en definitiva TODO lo documentado aqui, puede cambiar en una futura version de PHP SIN AVISO.

source: Use this extension at your own risk.
es: Quedas avisado, y utilizar este módulo es tu responsabiliad.

source: For related functions such as dirname(), is_dir(), mkdir(), and rmdir(), see the Filesystem section.
es: Siguiente

source: dio_write
es: Subir

source: Therefore, if you want to read an XML file and write a modified version, use DomDocument_create_element(), DomDocument_create_text_node(), set_attribute(), etc. and finally the DomDocument_dump_mem() function.
es: Aviso

source: Download and install this library.
es: Este módulo es EXPERIMENTAL.

source: Download and install these libraries if you plan to use (enhanced XSLT features.
es: Esto significa que el comportamineto de estas funciones, nombre de funciones y en definitiva TODO lo documentado aqui, puede cambiar en una futura version de PHP SIN AVISO.

source: Add --with-dom-exslt[ =DIR] to include DOM EXSLT support, where DIR is the libexslt install directory.
es: Quedas avisado, y utilizar este módulo es tu responsabiliad.

source: In order to enable this module on a Windows environment, you must copy libxml2.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:
es: Estas funciones son disponibles solamente si PHP fué configurado con --with-dom=[ DIR], usando al libreria de XML de GNOME.

source: There are quite a few functions that do not fit into the DOM standard and should no longer be used.
es: Usted va a necesitar como mínimo libxml-2.0.0 (la versión beta no trabajará).

source: The function DomNode_append_child() The function DomNode_append_child() has changed its behaviour.
es: Estas functiones fueron añadidas en PHP4.

source: If this breaks your application, use the non-DOM function DomNode_append_sibling().
es: Este module define las siguientes constantes:

source: Old function
es: Tabla 1.

source: DomDocument_dump_mem_file
es: Constantes de XML

source: DomDocument_create_element() followed by DomNode_append_child()
es: Constante

source: DomDocument_children
es: Valor

source: DomDocument_imported_node
es: Descripción

source: DomDocument_create_element() und add it with DomNode_append_child().
es: XML_ELEMENT_NODE

source: DomDocument_create_element() and add it with DomNode_append_child().
es: XML_ATTRIBUTE_NODE

source: DomNode_get_content
es: XML_TEXT_NODE

source: XML_CDATA_SECTION_NODE (integer)
es: XML_ENTITY_REF_NODE

source: XML_COMMENT_NODE (integer)
es: XML_ENTITY_NODE

source: XML_DOCUMENT_TYPE_NODE (integer)
es: XML_PI_NODE

source: XML_ATTRIBUTE_DECL_NODE (integer)
es: XML_COMMENT_NODE

source: XML_ATTRIBUTE_ID (integer)
es: XML_DOCUMENT_NODE

source: XML_ATTRIBUTE_NMTOKEN (integer)
es: XML_DOCUMENT_TYPE_NODE

source: XPATH_UNDEFINED (integer)
es: XML_DOCUMENT_FRAG_NODE

source: XPATH_STRING (integer)
es: XML_NOTATION_NODE
